load-test.jmx
<?xml version='1.0' encoding='UTF-8'?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.4.1">
	<hashTree>
		<TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
			<boolProp name="TestPlan.functional_mode">false</boolProp>
			<boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
			<elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" enabled="true" />
		</TestPlan>
		<hashTree>
			<ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="20 Users - 1 Request Each" enabled="true">
				<stringProp name="ThreadGroup.num_threads">20</stringProp>
				<stringProp name="ThreadGroup.ramp_time">1</stringProp>
				<boolProp name="ThreadGroup.scheduler">false</boolProp>
			</ThreadGroup>
			<hashTree>
				<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST Chambre 1" enabled="true">
					<boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
					<stringProp name="HTTPSampler.protocol">http</stringProp>
					<stringProp name="HTTPSampler.path">/Foyer/chambre/addOrUpdate</stringProp>
					<stringProp name="HTTPSampler.method">POST</stringProp>
					<elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true" />
					<elementProp name="HTTPsampler.Arguments" elementType="Arguments">
						<collectionProp name="Arguments.arguments">
							<elementProp name="" elementType="HTTPArgument">
								<boolProp name="HTTPArgument.always_encode">false</boolProp>
								<stringProp name="Argument.value">{"numeroChambre": 1, "typeC": "SIMPLE"}</stringProp>
								<stringProp name="Argument.metadata">=</stringProp>
								<boolProp name="HTTPArgument.use_equals">true</boolProp>
							</elementProp>
						</collectionProp>
					</elementProp>
				</HTTPSamplerProxy>
				<hashTree />
				<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST Chambre 2" enabled="true">
					<boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
					<stringProp name="HTTPSampler.protocol">http</stringProp>
					<stringProp name="HTTPSampler.path">/Foyer/chambre/addOrUpdate</stringProp>
					<stringProp name="HTTPSampler.method">POST</stringProp>
					<elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true" />
					<elementProp name="HTTPsampler.Arguments" elementType="Arguments">
						<collectionProp name="Arguments.arguments">
							<elementProp name="" elementType="HTTPArgument">
								<boolProp name="HTTPArgument.always_encode">false</boolProp>
								<stringProp name="Argument.value">{"numeroChambre": 2, "typeC": "SIMPLE"}</stringProp>
								<stringProp name="Argument.metadata">=</stringProp>
								<boolProp name="HTTPArgument.use_equals">true</boolProp>
							</elementProp>
						</collectionProp>
					</elementProp>
				</HTTPSamplerProxy>
				<hashTree />
				<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST Chambre 3" enabled="true">
					<boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
					<stringProp name="HTTPSampler.protocol">http</stringProp>
					<stringProp name="HTTPSampler.path">/Foyer/chambre/addOrUpdate</stringProp>
					<stringProp name="HTTPSampler.method">POST</stringProp>
					<elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true" />
					<elementProp name="HTTPsampler.Arguments" elementType="Arguments">
						<collectionProp name="Arguments.arguments">
							<elementProp name="" elementType="HTTPArgument">
								<boolProp name="HTTPArgument.always_encode">false</boolProp>
								<stringProp name="Argument.value">{"numeroChambre": 3, "typeC": "SIMPLE"}</stringProp>
								<stringProp name="Argument.metadata">=</stringProp>
								<boolProp name="HTTPArgument.use_equals">true</boolProp>
							</elementProp>
						</collectionProp>
					</elementProp>
				</HTTPSamplerProxy>
				<hashTree />
				<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST Chambre 4" enabled="true">
					<boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
					<stringProp name="HTTPSampler.protocol">http</stringProp>
					<stringProp name="HTTPSampler.path">/Foyer/chambre/addOrUpdate</stringProp>
					<stringProp name="HTTPSampler.method">POST</stringProp>
					<elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true" />
					<elementProp name="HTTPsampler.Arguments" elementType="Arguments">
						<collectionProp name="Arguments.arguments">
							<elementProp name="" elementType="HTTPArgument">
								<boolProp name="HTTPArgument.always_encode">false</boolProp>
								<stringProp name="Argument.value">{"numeroChambre": 4, "typeC": "SIMPLE"}</stringProp>
								<stringProp name="Argument.metadata">=</stringProp>
								<boolProp name="HTTPArgument.use_equals">true</boolProp>
							</elementProp>
						</collectionProp>
					</elementProp>
				</HTTPSamplerProxy>
				<hashTree />
				<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST Chambre 5" enabled="true">
					<boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
					<stringProp name="HTTPSampler.protocol">http</stringProp>
					<stringProp name="HTTPSampler.path">/Foyer/chambre/addOrUpdate</stringProp>
					<stringProp name="HTTPSampler.method">POST</stringProp>
					<elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true" />
					<elementProp name="HTTPsampler.Arguments" elementType="Arguments">
						<collectionProp name="Arguments.arguments">
							<elementProp name="" elementType="HTTPArgument">
								<boolProp name="HTTPArgument.always_encode">false</boolProp>
								<stringProp name="Argument.value">{"numeroChambre": 5, "typeC": "SIMPLE"}</stringProp>
								<stringProp name="Argument.metadata">=</stringProp>
								<boolProp name="HTTPArgument.use_equals">true</boolProp>
							</elementProp>
						</collectionProp>
					</elementProp>
				</HTTPSamplerProxy>
				<hashTree />
				<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST Chambre 6" enabled="true">
					<boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
					<stringProp name="HTTPSampler.protocol">http</stringProp>
					<stringProp name="HTTPSampler.path">/Foyer/chambre/addOrUpdate</stringProp>
					<stringProp name="HTTPSampler.method">POST</stringProp>
					<elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true" />
					<elementProp name="HTTPsampler.Arguments" elementType="Arguments">
						<collectionProp name="Arguments.arguments">
							<elementProp name="" elementType="HTTPArgument">
								<boolProp name="HTTPArgument.always_encode">false</boolProp>
								<stringProp name="Argument.value">{"numeroChambre": 6, "typeC": "SIMPLE"}</stringProp>
								<stringProp name="Argument.metadata">=</stringProp>
								<boolProp name="HTTPArgument.use_equals">true</boolProp>
							</elementProp>
						</collectionProp>
					</elementProp>
				</HTTPSamplerProxy>
				<hashTree />
				<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST Chambre 7" enabled="true">
					<boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
					<stringProp name="HTTPSampler.protocol">http</stringProp>
					<stringProp name="HTTPSampler.path">/Foyer/chambre/addOrUpdate</stringProp>
					<stringProp name="HTTPSampler.method">POST</stringProp>
					<elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true" />
					<elementProp name="HTTPsampler.Arguments" elementType="Arguments">
						<collectionProp name="Arguments.arguments">
							<elementProp name="" elementType="HTTPArgument">
								<boolProp name="HTTPArgument.always_encode">false</boolProp>
								<stringProp name="Argument.value">{"numeroChambre": 7, "typeC": "SIMPLE"}</stringProp>
								<stringProp name="Argument.metadata">=</stringProp>
								<boolProp name="HTTPArgument.use_equals">true</boolProp>
							</elementProp>
						</collectionProp>
					</elementProp>
				</HTTPSamplerProxy>
				<hashTree />
				<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST Chambre 8" enabled="true">
					<boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
					<stringProp name="HTTPSampler.protocol">http</stringProp>
					<stringProp name="HTTPSampler.path">/Foyer/chambre/addOrUpdate</stringProp>
					<stringProp name="HTTPSampler.method">POST</stringProp>
					<elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true" />
					<elementProp name="HTTPsampler.Arguments" elementType="Arguments">
						<collectionProp name="Arguments.arguments">
							<elementProp name="" elementType="HTTPArgument">
								<boolProp name="HTTPArgument.always_encode">false</boolProp>
								<stringProp name="Argument.value">{"numeroChambre": 8, "typeC": "SIMPLE"}</stringProp>
								<stringProp name="Argument.metadata">=</stringProp>
								<boolProp name="HTTPArgument.use_equals">true</boolProp>
							</elementProp>
						</collectionProp>
					</elementProp>
				</HTTPSamplerProxy>
				<hashTree />
				<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST Chambre 9" enabled="true">
					<boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
					<stringProp name="HTTPSampler.protocol">http</stringProp>
					<stringProp name="HTTPSampler.path">/Foyer/chambre/addOrUpdate</stringProp>
					<stringProp name="HTTPSampler.method">POST</stringProp>
					<elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true" />
					<elementProp name="HTTPsampler.Arguments" elementType="Arguments">
						<collectionProp name="Arguments.arguments">
							<elementProp name="" elementType="HTTPArgument">
								<boolProp name="HTTPArgument.always_encode">false</boolProp>
								<stringProp name="Argument.value">{"numeroChambre": 9, "typeC": "SIMPLE"}</stringProp>
								<stringProp name="Argument.metadata">=</stringProp>
								<boolProp name="HTTPArgument.use_equals">true</boolProp>
							</elementProp>
						</collectionProp>
					</elementProp>
				</HTTPSamplerProxy>
				<hashTree />
				<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST Chambre 10" enabled="true">
					<boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
					<stringProp name="HTTPSampler.protocol">http</stringProp>
					<stringProp name="HTTPSampler.path">/Foyer/chambre/addOrUpdate</stringProp>
					<stringProp name="HTTPSampler.method">POST</stringProp>
					<elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true" />
					<elementProp name="HTTPsampler.Arguments" elementType="Arguments">
						<collectionProp name="Arguments.arguments">
							<elementProp name="" elementType="HTTPArgument">
								<boolProp name="HTTPArgument.always_encode">false</boolProp>
								<stringProp name="Argument.value">{"numeroChambre": 10, "typeC": "SIMPLE"}</stringProp>
								<stringProp name="Argument.metadata">=</stringProp>
								<boolProp name="HTTPArgument.use_equals">true</boolProp>
							</elementProp>
						</collectionProp>
					</elementProp>
				</HTTPSamplerProxy>
				<hashTree />
				<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST Chambre 11" enabled="true">
					<boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
					<stringProp name="HTTPSampler.protocol">http</stringProp>
					<stringProp name="HTTPSampler.path">/Foyer/chambre/addOrUpdate</stringProp>
					<stringProp name="HTTPSampler.method">POST</stringProp>
					<elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true" />
					<elementProp name="HTTPsampler.Arguments" elementType="Arguments">
						<collectionProp name="Arguments.arguments">
							<elementProp name="" elementType="HTTPArgument">
								<boolProp name="HTTPArgument.always_encode">false</boolProp>
								<stringProp name="Argument.value">{"numeroChambre": 11, "typeC": "SIMPLE"}</stringProp>
								<stringProp name="Argument.metadata">=</stringProp>
								<boolProp name="HTTPArgument.use_equals">true</boolProp>
							</elementProp>
						</collectionProp>
					</elementProp>
				</HTTPSamplerProxy>
				<hashTree />
				<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST Chambre 12" enabled="true">
					<boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
					<stringProp name="HTTPSampler.protocol">http</stringProp>
					<stringProp name="HTTPSampler.path">/Foyer/chambre/addOrUpdate</stringProp>
					<stringProp name="HTTPSampler.method">POST</stringProp>
					<elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true" />
					<elementProp name="HTTPsampler.Arguments" elementType="Arguments">
						<collectionProp name="Arguments.arguments">
							<elementProp name="" elementType="HTTPArgument">
								<boolProp name="HTTPArgument.always_encode">false</boolProp>
								<stringProp name="Argument.value">{"numeroChambre": 12, "typeC": "SIMPLE"}</stringProp>
								<stringProp name="Argument.metadata">=</stringProp>
								<boolProp name="HTTPArgument.use_equals">true</boolProp>
							</elementProp>
						</collectionProp>
					</elementProp>
				</HTTPSamplerProxy>
				<hashTree />
				<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST Chambre 13" enabled="true">
					<boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
					<stringProp name="HTTPSampler.protocol">http</stringProp>
					<stringProp name="HTTPSampler.path">/Foyer/chambre/addOrUpdate</stringProp>
					<stringProp name="HTTPSampler.method">POST</stringProp>
					<elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true" />
					<elementProp name="HTTPsampler.Arguments" elementType="Arguments">
						<collectionProp name="Arguments.arguments">
							<elementProp name="" elementType="HTTPArgument">
								<boolProp name="HTTPArgument.always_encode">false</boolProp>
								<stringProp name="Argument.value">{"numeroChambre": 13, "typeC": "SIMPLE"}</stringProp>
								<stringProp name="Argument.metadata">=</stringProp>
								<boolProp name="HTTPArgument.use_equals">true</boolProp>
							</elementProp>
						</collectionProp>
					</elementProp>
				</HTTPSamplerProxy>
				<hashTree />
				<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST Chambre 14" enabled="true">
					<boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
					<stringProp name="HTTPSampler.protocol">http</stringProp>
					<stringProp name="HTTPSampler.path">/Foyer/chambre/addOrUpdate</stringProp>
					<stringProp name="HTTPSampler.method">POST</stringProp>
					<elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true" />
					<elementProp name="HTTPsampler.Arguments" elementType="Arguments">
						<collectionProp name="Arguments.arguments">
							<elementProp name="" elementType="HTTPArgument">
								<boolProp name="HTTPArgument.always_encode">false</boolProp>
								<stringProp name="Argument.value">{"numeroChambre": 14, "typeC": "SIMPLE"}</stringProp>
								<stringProp name="Argument.metadata">=</stringProp>
								<boolProp name="HTTPArgument.use_equals">true</boolProp>
							</elementProp>
						</collectionProp>
					</elementProp>
				</HTTPSamplerProxy>
				<hashTree />
				<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST Chambre 15" enabled="true">
					<boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
					<stringProp name="HTTPSampler.protocol">http</stringProp>
					<stringProp name="HTTPSampler.path">/Foyer/chambre/addOrUpdate</stringProp>
					<stringProp name="HTTPSampler.method">POST</stringProp>
					<elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true" />
					<elementProp name="HTTPsampler.Arguments" elementType="Arguments">
						<collectionProp name="Arguments.arguments">
							<elementProp name="" elementType="HTTPArgument">
								<boolProp name="HTTPArgument.always_encode">false</boolProp>
								<stringProp name="Argument.value">{"numeroChambre": 15, "typeC": "SIMPLE"}</stringProp>
								<stringProp name="Argument.metadata">=</stringProp>
								<boolProp name="HTTPArgument.use_equals">true</boolProp>
							</elementProp>
						</collectionProp>
					</elementProp>
				</HTTPSamplerProxy>
				<hashTree />
				<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST Chambre 16" enabled="true">
					<boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
					<stringProp name="HTTPSampler.protocol">http</stringProp>
					<stringProp name="HTTPSampler.path">/Foyer/chambre/addOrUpdate</stringProp>
					<stringProp name="HTTPSampler.method">POST</stringProp>
					<elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true" />
					<elementProp name="HTTPsampler.Arguments" elementType="Arguments">
						<collectionProp name="Arguments.arguments">
							<elementProp name="" elementType="HTTPArgument">
								<boolProp name="HTTPArgument.always_encode">false</boolProp>
								<stringProp name="Argument.value">{"numeroChambre": 16, "typeC": "SIMPLE"}</stringProp>
								<stringProp name="Argument.metadata">=</stringProp>
								<boolProp name="HTTPArgument.use_equals">true</boolProp>
							</elementProp>
						</collectionProp>
					</elementProp>
				</HTTPSamplerProxy>
				<hashTree />
				<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST Chambre 17" enabled="true">
					<boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
					<stringProp name="HTTPSampler.protocol">http</stringProp>
					<stringProp name="HTTPSampler.path">/Foyer/chambre/addOrUpdate</stringProp>
					<stringProp name="HTTPSampler.method">POST</stringProp>
					<elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true" />
					<elementProp name="HTTPsampler.Arguments" elementType="Arguments">
						<collectionProp name="Arguments.arguments">
							<elementProp name="" elementType="HTTPArgument">
								<boolProp name="HTTPArgument.always_encode">false</boolProp>
								<stringProp name="Argument.value">{"numeroChambre": 17, "typeC": "SIMPLE"}</stringProp>
								<stringProp name="Argument.metadata">=</stringProp>
								<boolProp name="HTTPArgument.use_equals">true</boolProp>
							</elementProp>
						</collectionProp>
					</elementProp>
				</HTTPSamplerProxy>
				<hashTree />
				<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST Chambre 18" enabled="true">
					<boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
					<stringProp name="HTTPSampler.protocol">http</stringProp>
					<stringProp name="HTTPSampler.path">/Foyer/chambre/addOrUpdate</stringProp>
					<stringProp name="HTTPSampler.method">POST</stringProp>
					<elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true" />
					<elementProp name="HTTPsampler.Arguments" elementType="Arguments">
						<collectionProp name="Arguments.arguments">
							<elementProp name="" elementType="HTTPArgument">
								<boolProp name="HTTPArgument.always_encode">false</boolProp>
								<stringProp name="Argument.value">{"numeroChambre": 18, "typeC": "SIMPLE"}</stringProp>
								<stringProp name="Argument.metadata">=</stringProp>
								<boolProp name="HTTPArgument.use_equals">true</boolProp>
							</elementProp>
						</collectionProp>
					</elementProp>
				</HTTPSamplerProxy>
				<hashTree />
				<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST Chambre 19" enabled="true">
					<boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
					<stringProp name="HTTPSampler.protocol">http</stringProp>
					<stringProp name="HTTPSampler.path">/Foyer/chambre/addOrUpdate</stringProp>
					<stringProp name="HTTPSampler.method">POST</stringProp>
					<elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true" />
					<elementProp name="HTTPsampler.Arguments" elementType="Arguments">
						<collectionProp name="Arguments.arguments">
							<elementProp name="" elementType="HTTPArgument">
								<boolProp name="HTTPArgument.always_encode">false</boolProp>
								<stringProp name="Argument.value">{"numeroChambre": 19, "typeC": "SIMPLE"}</stringProp>
								<stringProp name="Argument.metadata">=</stringProp>
								<boolProp name="HTTPArgument.use_equals">true</boolProp>
							</elementProp>
						</collectionProp>
					</elementProp>
				</HTTPSamplerProxy>
				<hashTree />
				<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST Chambre 20" enabled="true">
					<boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
					<stringProp name="HTTPSampler.protocol">http</stringProp>
					<stringProp name="HTTPSampler.path">/Foyer/chambre/addOrUpdate</stringProp>
					<stringProp name="HTTPSampler.method">POST</stringProp>
					<elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true" />
					<elementProp name="HTTPsampler.Arguments" elementType="Arguments">
						<collectionProp name="Arguments.arguments">
							<elementProp name="" elementType="HTTPArgument">
								<boolProp name="HTTPArgument.always_encode">false</boolProp>
								<stringProp name="Argument.value">{"numeroChambre": 20, "typeC": "SIMPLE"}</stringProp>
								<stringProp name="Argument.metadata">=</stringProp>
								<boolProp name="HTTPArgument.use_equals">true</boolProp>
							</elementProp>
						</collectionProp>
					</elementProp>
				</HTTPSamplerProxy>
				<hashTree /></hashTree>
		</hashTree>
	</hashTree>
</jmeterTestPlan>